This is a practice on pandas' loc and iloc functions to improve efficiency in Exploratory Data Analysis or data wrangling.

import pandas as pd
import random

In [2]:
data = pd.read_csv("uk-500.csv")

In [3]:
data.head(5)

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk
1,Evan,Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
2,France,Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk
3,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk
4,Tyisha,Veness,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk

# 1. Selecting pandas data using "iloc"

Purpose: used with Dataframe to select rows and columns by number

Syntax: data.iloc[row selection,column selection]

Row/column selection: 
- Single row/column number eg. 1
- Slice of rows/columns eg. 4:7
- Integer list of rows eg. [0,1,2]

In [7]:
#let's try to access row index 4 and column index 4 of the dataset. It should give "Greets Green and Lyng Ward"
data.iloc[4,4]

'Greets Green and Lyng Ward'

In [12]:
#now let's try to access a slice of columns. We want to get the first_name and last_name of the row index 3.
data.iloc[3,0:2]

first_name      Ulysses
last_name     Mcwalters
Name: 3, dtype: object

In [13]:
#now, assume that we want to get the first and last names of people with row index 1 to 4.
data.iloc[1:5,0:2]

  first_name  last_name
1       Evan  Zigomalas
2     France    Andrade
3    Ulysses  Mcwalters
4     Tyisha     Veness

In [18]:
#What if I want to access row index 4,7,8 to find out about their first_name, last_name, city, phone1 and email?
data.columns

Index(['first_name', 'last_name', 'company_name', 'address', 'city', 'county',
       'postal', 'phone1', 'phone2', 'email', 'web'],
      dtype='object')

In [19]:
data.iloc[[4,7,8],[0,1,4,7,9]]

,first_name,last_name,city,phone1,email
4,Tyisha,Veness,Greets Green and Lyng Ward,01547-429341,tyisha.veness@hotmail.com
7,Laquita,Hisaw,Chirton Ward,01746-394243,laquita@yahoo.com
8,Lura,Manzella,Staple Hill Ward,01907-538509,lura@hotmail.com

Note:
If single row/column is selected, returns series.
If multiple rows/columns are selected, returns Dataframe. 
If value is in list, returns Dataframe.

In [28]:
print (type(data.iloc[5,5]))
print (type(data.iloc[5]))
print (type(data.iloc[0:2,3]))
print (type(data.iloc[0:2,0:3]))
print (type(data.iloc[[3]]))

<class 'str'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

# 2. Selecting pandas data using "loc"

Purpose: used with Dataframes to 
- select rows by label/index
- select rows with a boolean/conditional lookup

Syntax: data.loc[row selection,column selection]

## 2a. Label-based/ Index-based indexing using .loc

In this method, .loc directly selects based on index values of any rows. These can be numbers or labels.

In [30]:
#let's set "country" as the index
data.set_index("city", inplace=True)
data.head()

,first_name,last_name,company_name,address,county,postal,phone1,phone2,email,web
city,,,,,,,,,,
St. Stephens Ward,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk
Abbey Ward,Evan,Zigomalas,Cap Gemini America,5 Binney St,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
East Southbourne and Tuckton W,France,Andrade,"Elliott, John W Esq",8 Moor Place,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk
Hawerby cum Beesby,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk
Greets Green and Lyng Ward,Tyisha,Veness,Champagne Room,5396 Forth Street,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk

In [31]:
#Now, if we want to access rows with "Abbey Ward" and "Hawerby cum Beesby":
data.loc[["Abbey Ward","Hawerby cum Beesby"]]

,first_name,last_name,company_name,address,county,postal,phone1,phone2,email,web
city,,,,,,,,,,
Abbey Ward,Evan,Zigomalas,Cap Gemini America,5 Binney St,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk
Hawerby cum Beesby,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk

In [34]:
#if want specific columns:
data.loc[["Abbey Ward","Hawerby cum Beesby"], ["first_name","last_name","phone1"]]

                   first_name  last_name        phone1
city
Abbey Ward               Evan  Zigomalas  01937-864715
Hawerby cum Beesby    Ulysses  Mcwalters  01912-771311

In [38]:
#if want to reset index
data.reset_index(inplace=True)

In [39]:
data.loc[400]             #access row with index 400

city                                     Church Langley Ward
first_name                                            Leeann
last_name                                              Flory
company_name                  Fleetwood Area School District
address                                    1761 Johnstone St
county                                                 Essex
postal                                              CM17 9TZ
phone1                                          01906-807997
phone2                                          01997-771926
email                                       leeann@gmail.com
web             http://www.fleetwoodareaschooldistrict.co.uk
Name: 400, dtype: object

Note: accessing row with index 400 and accessing row with position 400 is totally different. The former may have an index of 400, but a position of another number as rows may get jumbled up.

## 2b. Boolean/ Logical indexing using .loc

For this method, we pass in an array or series of True/False values into the row or column selectors. Only rows where Series have True values are selected.
- eg. data['first_name'] == "Antonio" produces a Series with True/False for each value

In [42]:
data['first_name'] == "Antonio"

0      False
1      False
2      False
3      False
4      False
5      False
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22     False
23     False
24     False
25     False
26     False
27     False
28     False
29     False
       ...
470    False
471    False
472    False
473    False
474    False
475    False
476    False
477    False
478    False
479    False
480    False
481    False
482    False
483    False
484    False
485    False
486    False
487    False
488    False
489    False
490    False
491    False
492    False
493    False
494    False
495    False
496    False
497    False
498    False
499    False
Name: first_name, Length: 500, dtype: bool

In [43]:
#passing this series into the .loc method, will cause .loc method to only select the row with a True value
data.loc[data["first_name"]=="Antonio"]

,city,first_name,last_name,company_name,address,county,postal,phone1,phone2,email,web
272,Little Parndon and Hare Street,Antonio,Villamarin,Combs Sheetmetal,353 Standish St #8264,Hertfordshire,CM20 2HT,01559-403415,01388-777812,antonio.villamarin@gmail.com,http://www.combssheetmetal.co.uk
285,Gaer Community,Antonio,Glasford,Saint Thomas Creations,425 Howley St,Newport,NP20 3DE,01463-409090,01242-318420,antonio_glasford@glasford.co.uk,http://www.saintthomascreations.co.uk
427,Ipplepen,Antonio,Heilig,Radisson Suite Hotel,35 Elton St #3,Devon,TQ12 5LL,01324-171614,01442-946357,antonio.heilig@gmail.com,http://www.radissonsuitehotel.co.uk

In [44]:
data.loc[data["first_name"]=="Antonio", 'email']

272       antonio.villamarin@gmail.com
285    antonio_glasford@glasford.co.uk
427           antonio.heilig@gmail.com
Name: email, dtype: object

In [46]:
#put column value into a list, to maintain Dataframe type
data.loc[data["first_name"]=="Antonio", ['email']]

                               email
272     antonio.villamarin@gmail.com
285  antonio_glasford@glasford.co.uk
427         antonio.heilig@gmail.com

In [48]:
#After accessing rows that fulfill a condition, we can also change their value
# Change the first name, of all rows with first_name "Antonio" to "John"

data.loc[data['first_name'] == "Antonio", "first_name"] = "John"

In [49]:
data.loc[data['first_name'] == "John"]

,city,first_name,last_name,company_name,address,county,postal,phone1,phone2,email,web
272,Little Parndon and Hare Street,John,Villamarin,Combs Sheetmetal,353 Standish St #8264,Hertfordshire,CM20 2HT,01559-403415,01388-777812,antonio.villamarin@gmail.com,http://www.combssheetmetal.co.uk
285,Gaer Community,John,Glasford,Saint Thomas Creations,425 Howley St,Newport,NP20 3DE,01463-409090,01242-318420,antonio_glasford@glasford.co.uk,http://www.saintthomascreations.co.uk
427,Ipplepen,John,Heilig,Radisson Suite Hotel,35 Elton St #3,Devon,TQ12 5LL,01324-171614,01442-946357,antonio.heilig@gmail.com,http://www.radissonsuitehotel.co.uk